---
type: FolderItemInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# FolderItemInfo

`Autodesk.Revit.DB.FolderItemInfo` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | ElementId | 2015 | `public ElementId ElementId { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Name | 2015 | `public string Name { get ; }` |